export const filters = { //Потрібно додати кудись виведення загальної суми чеків (всіх і конкретного касира) + окремо кількість проданого продукту (id атрибут)
    "employee": [
        { label: "Всі працівники", value: "surname_asc" },
        { label: "Тільки касири", value: "check_role" }
    ],
    "customer-card": [ //або поле щоб самостійно вводити значення знижки
        { label: "За прізвищем (А-Я)", value: "surname_asc" },
        { label: "Клієнти зі 5% знижкою", value: "discount_5" },
        { label: "Клієнти зі 10% знижкою", value: "discount_10" },
        { label: "Клієнти зі 15% знижкою", value: "discount_15" }
    ],
    "category": [], //немає фільтру взагалі

    "product": [ //випадний список категорій
        { label: "Категорія", value: "" }
    ],
    "store-product": [ //варіант або чотири кнопки (акційні за назвою, акційні за кількістю і не акц. те саме
                        //або два види кнопок що поєднуються окремо товар і окремо за чим сортувати
        { label: "Всі продукти", value: "name_asc" },
        { label: "Акційні товари", value: "name_asc" },
        { label: "Не акційні товари", value: "name_asc" },
        { label: "Акційні товари", value: "quantity_asc" },
        { label: "Не акційні товари", value: "quantity_asc" },
    ],
    "receipt": [ //у менеджера: випадний список касирів або всі + дата (початок і кінець або 1 день конкретний)
        //у касира: всі його чеки те саме але не може обрати касира, за замовчуванням стоїть він
        { label: "Спершу нові", value: "date_desc" },
    ]
};